//求m,n最大公约数
#include<stdio.h>
//辗转相除法
/*两个数的最大公约数,将其中一个数加到另一个数上,得到的新数,其公约数不变
迭代相减法：
　　 (78,14)=(64,14)=(50,14)=(36,14)=(22,14)=(8,14)=(8,6)=(2,6)=(2,4)=(2,2)=(0,2)=2
　　 基本上思路就是大数减去小数,一直减到能算出来为止,在作为练习的时候,往往进行到某一步就已经可以看出得值.
    迭代相减法简单,不过步数比较多,实际上我们可以看到,在上面的过程中,由(78,14)到(8,14)完全可以一步到位
    因为(78,14)=(14×5+8,14)=(8,14),由此就诞生出我们的辗转相除法.
*/
int main(){
    int m,n,max = -1;
    scanf("%d%d",&m,&n);

    while(max != 0){
        max = m % n;
        if(max == 0){
            printf("%d",n);
            break;
        }
        else{
            m = n;
            n = max;
        }
    }
}
// int main(){
//     int i,m,n,max=1;
//     scanf("%d%d",&m,&n);
//     if(m >= n){
//         if(m % n == 0)printf("%d",n);
//         else{
//             for(i=1;i<n;i++){
//                 if(n % i == 0)max = i;
//             }
//             printf("%d",max);
//         }
//     }
//     else{
//         if(n % m == 0)printf("%d",m);
//         else{
//             for(i=1;i<m;i++){
//                 if(m % i == 0)max = i;
//             }
//             printf("%d",max);
//         }
//     }
//     return 0;
// }